openwch/ch32x315/EVT/EXAM/USBSS/DEVICE/CH372Device/User/ch32x3x5_usbss_it.c
                        /* get usb string descriptor */
                        case USB_DESCR_TYP_STRING:
                            switch((uint8_t)( USBSS_SetupReqValue & 0xFF ))
                            {
                                /* Descriptor 0, Language descriptor */
                                case DEF_STRING_DESC_LANG:
                                    pUSBSS_Descr = MyLangDescr;
                                    len = DEF_USBSSD_LANG_DESC_LEN;
                                    break;

                                /* Descriptor 1, Manufacturers String descriptor */
                                case DEF_STRING_DESC_MANU:
                                    pUSBSS_Descr = MyManuInfo;
                                    len = DEF_USBSSD_MANU_DESC_LEN;
                                    break;

                                /* Descriptor 2, Product String descriptor */
                                case DEF_STRING_DESC_PROD:
                                    pUSBSS_Descr = MyProdInfo;
                                    len = DEF_USBSSD_PROD_DESC_LEN;
                                    break;

                                /* Descriptor 3, Serial-number String descriptor */
                                case DEF_STRING_DESC_SERN:
                                    pUSBSS_Descr = MySerNumInfo;
                                    len = DEF_USBSSD_SN_DESC_LEN;
                                    break;
                                
                                case DEF_STRING_DESC_OS:
                                    pUSBSS_Descr = OSStringDescriptor;
                                    len = DEF_USBSSD_OS_DESC_LEN;
                                    break;

                                default:
                                    errflag = 0xFF;
                                    break;
                            }
                            break;

                        /* get usb device qualify descriptor */
                        case USB_DESCR_TYP_QUALIF:
                            pUSBSS_Descr = MyQuaDesc;
                            len = DEF_USBSSD_QUA_DESC_LEN;
                            break;

                        /* get usb BOS descriptor */
                        case USB_DESCR_TYP_BOS:
                            /* USB 2.00 DO NOT support BOS descriptor */
                            pUSBSS_Descr = MyBOSDesc_SS;
                            len = DEF_USBSSD_BOS_DESC_LEN;
                            break;

                        default :
                            errflag = 0xFF;
                            break;
                    }

                    /* Copy Descriptors to Endp0 DMA buffer */
                    if( USBSS_SetupReqLen > len )
                    {
                        USBSS_SetupReqLen = len;
                    }
                    len = (USBSS_SetupReqLen >= DEF_USBSSD_UEP0_SIZE) ? DEF_USBSSD_UEP0_SIZE : USBSS_SetupReqLen;
                    memcpy( USBSS_EP0_Buf, pUSBSS_Descr, len );
                    pUSBSS_Descr += len;
                    break;

                /* Set usb address */
                case USB_SET_ADDRESS:
                    USBSS_Dev_Info.set_devaddr = 1;
                    USBSS_Dev_Info.devaddr = (uint16_t)( USBSS_SetupReqValue & 0xFF );
                    break;

                /* Get usb configuration now set */
                case USB_GET_CONFIGURATION:
                    USBSS_EP0_Buf[ 0 ] = USBSS_DevConfig;
                    if ( USBSS_SetupReqLen > 1 )
                    {
                        USBSS_SetupReqLen = 1;
                    }
                    break;
                    
                /* set iso delay */
                case USB_SET_ISOCH_DLY:
                    USBSS_Dev_Info.set_isoch_delay = 1;
                    USBSS_Dev_Info.set_isoch_value = (uint16_t)( USBSS_SetupReqValue & 0xFFFF );
                    break;

                /* set sel */
                case USB_SET_SEL:
                    break;

                /* Set usb configuration to use */
                case USB_SET_CONFIGURATION:
                    USBSS_DevConfig = (uint8_t)( USBSS_SetupReqValue & 0xFF );
                    if( USBSS_DevConfig && ( USBSS_DevConfig != SS_ConfigDescriptor[ 5 ] ))
                    {
                        USBSS_DevConfig = SS_ConfigDescriptor[ 5 ];
                        errflag = 0xFF;
                    }
                    else if( USBSS_DevConfig == 0 )
                    {
                        USBSS_DevEnumStatus = 0x00;
                    }
                    else 
                    {
                        USBSS_DevEnumStatus = 0x01;
                    }
                    if( USBSS_DevConfig != ( USBSS_SetupReqValue & 0xFF ))
                    {
                        USBSS_Dev_Info.u1_enable = DISABLE;
                        USBSS_Dev_Info.u2_enable = DISABLE;
                    }
 
                    break;

                /* Clear or disable one usb feature */    
                case USB_CLEAR_FEATURE:
                    if( ( USBSS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
                    {
                        /* clear one device feature */
                        if((uint8_t)( USBSS_SetupReqValue & 0xFF ) == 0x01 )
                        {
                            /* clear usb sleep status, device not prepare to sleep */
                            USBSS_DevSleepStatus &= ~0x01;
                        }
                        else if((uint8_t)( USBSS_SetupReqValue & 0xFF ) == USB_U1_ENABLE )
                        {

#ifdef DEF_UP_U1_EN             /* disable U1 */
                            USBSSD->LINK_CFG &= ~LINK_U1_ALLOW;
                            USBSS_Dev_Info.u1_enable = DISABLE;
#endif


                        }
                        else if((uint8_t)( USBSS_SetupReqValue & 0xFF ) == USB_U2_ENABLE )
                        {
#ifdef DEF_UP_U2_EN             /* disable U2 */
                            USBSSD->LINK_CFG &= ~LINK_U2_ALLOW;
                            USBSS_Dev_Info.u2_enable = DISABLE;
#endif
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                    }
                    else if(( USBSS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
                    {
                        /* Set End-point Feature */
                        if((uint8_t)( USBSS_SetupReqValue & 0xFF ) == USB_REQ_FEAT_ENDP_HALT )
                        {
                            /* Clear End-point Feature */
                            USBSS_Endp_Clear_Feature((uint8_t)( USBSS_SetupReqIndex & 0xFF ));
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                    }
                    else
                    {
                        errflag = 0xFF;
                    }
                    break;
                case USB_SET_FEATURE:
                    if( ( USBSS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
                    {
                        /* Set Device Feature */
                        if((uint8_t)(USBSS_SetupReqValue & 0xFF ) == USB_U1_ENABLE )
                        {
                            if( USBSS_DevEnumStatus )
                            {
#ifdef DEF_UP_U1_EN             /* enable U1 */
                                USBSSD->LINK_CFG |= LINK_U1_ALLOW;
                                USBSS_Dev_Info.u1_enable = ENABLE;
#endif
                            }
                            else
                            {
                                errflag = 0xFF;
                            }
                        }
                        else if ((uint8_t)(USBSS_SetupReqValue & 0xFF ) == USB_U2_ENABLE ) 
                        {                      
#ifdef DEF_UP_U2_EN             /* enable U2 */
                            if( USBSS_DevEnumStatus )
                            {
                                USBSSD->LINK_CFG |= LINK_U2_ALLOW;
                                USBSS_Dev_Info.u2_enable = ENABLE;
                            }
                            else
                            {
                                errflag = 0xFF;
                            }
#endif                           
                        }
                        else
                        {
                            errflag = 0xFF;
                        }
                    }
                    else if(( USBSS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
                    {
                        /* Set End-point Feature */
                        if( (uint8_t)( USBSS_SetupReqValue & 0xFF ) == USB_REQ_FEAT_ENDP_HALT )
                        {
                            /* Set end-points status stall */
                            USBSS_Endp_Set_Feature((uint8_t)(USBSS_SetupReqIndex & 0xFF ));
                        }
                    }

                    break;

                
                case USB_SET_INTERFACE:
                    break;

                /* This request allows the host to select another setting for the specified interface  */
                case USB_GET_INTERFACE:
                    USBSS_EP0_Buf[ 0 ] = 0x00;
                    if ( USBSS_SetupReqLen > 1 )
                    {
                        USBSS_SetupReqLen = 1;
                    }
                    break;

                /* host get status of specified device/interface/end-points */
                case USB_GET_STATUS:
                    USBSS_EP0_Buf[ 0 ] = 0x00;
                    USBSS_EP0_Buf[ 1 ] = 0x00;
                    if( ( USBSS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_ENDP )
                    {
                        errflag = USBSS_Get_Endp_Status((uint8_t)( USBSS_SetupReqIndex & 0xFF ));
                    }
                    else if( ( USBSS_SetupReqType & USB_REQ_RECIP_MASK ) == USB_REQ_RECIP_DEVICE )
                    {
                        if( USBSS_DevSleepStatus & 0x01 )
                        {
                            USBSS_EP0_Buf[ 0 ] = 0x02;
                        }
                        USBSS_EP0_Buf[ 0 ] |= ( USBSS_Dev_Info.u2_enable << 3 ) | ( USBSS_Dev_Info.u1_enable << 2 );
                    }
                    if ( USBSS_SetupReqLen > 2 )
                    {
                        USBSS_SetupReqLen = 2;
                    }
                    break;

                case USB_SET_ENDPOINT:
                    break;

                default :
                    errflag = 0xFF;
                    break;
            }
        }

