openwch/ch32x315/EVT/EXAM/USBSS/DEVICE/CH372Device/User/ch32x3x5_usbss_it.c
        /* errflag = 0xFF means a request not support or some errors occurred, else correct */
        if( errflag == 0xFF )
        {
            /* if one request not support, return stall */
            USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_STALL | USBSS_EP0_RX_STALL;
            USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_STALL;
        }
        else
        {
            /* end-point 0 data Tx/Rx */
            if( USBSS_SetupReqType & DEF_UEP_IN )
            {
                /* tx */
                if(USBSS_SetupReqLen == 0)
                {
                    USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK ;
                }
                else 
                {
                    len = ( USBSS_SetupReqLen > DEF_USBSSD_UEP0_SIZE ) ? DEF_USBSSD_UEP0_SIZE : USBSS_SetupReqLen;
                    USBSS_SetupReqLen -= len;
                    USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH | len;                         // DATA stage
                    USBSSD->UEP0_TX_CTRL |= USBSS_EP0_TX_ERDY;
                }
            }
            else
            {
                /* rx */
                if( USBSS_SetupReqLen == 0 )
                {
                    USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH;                        
                    USBSSD->UEP0_TX_CTRL |= USBSS_EP0_TX_ERDY;
                    USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK;
                    
                }
                else
                {
                    USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK;
                }
            }
        }
        USBSSD->USB_STATUS = USBSS_UDIF_SETUP;

    }
    else if( status & USBSS_UDIF_STATUS )
    {
        USBSSD->USB_STATUS = USBSS_UDIF_STATUS;                                         // clear int flag

        if( USBSS_Dev_Info.set_devaddr )
        {
            SET_Device_Address( USBSS_Dev_Info.devaddr, USBSSD );                           // SET ADDRESS 
            USBSS_Dev_Info.set_devaddr = 0;
        }
        else if( USBSS_Dev_Info.set_isoch_delay )
        {
            USBSSD->LINK_ISO_DLY = USBSS_Dev_Info.set_isoch_value;
            USBSS_Dev_Info.set_isoch_delay = 0;
        }

        USBSSD->UEP0_TX_CTRL = 0;
        USBSSD->UEP0_RX_CTRL = 0;

    }
    else if( status & USBSS_UIF_TRANSFER )
    {
        endp_num = ( status & USBSS_EP_ID_MASK ) >> 8;
        ep_dir = status & USBSS_EP_DIR_MASK;                                       // 1: IN, 0:OUT

        if( ep_dir )
        {
            switch( endp_num )
            {
                /* end-point 0 data in interrupt */
                case DEF_UEP0:
                    if(USBSS_SetupReqLen == 0)
                    {
                        USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH;                            // Zero Length
                        USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK ;       // ready status step
                    }
                    else
                    {
                        /* Standard request endpoint 0 Data upload */
                        switch(USBSS_SetupReqCode)
                        {
                            case USB_GET_DESCRIPTOR:
                                len = USBSS_SetupReqLen >= DEF_USBSSD_UEP0_SIZE ? DEF_USBSSD_UEP0_SIZE : USBSS_SetupReqLen;
                                memcpy(USBSS_EP0_Buf, pUSBSS_Descr, len);
                                USBSS_SetupReqLen -= len;
                                pUSBSS_Descr += len;                        
                                USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH | len | (((( USBSSD->UEP0_TX_CTRL >> 16 ) & 0x1F ) + 1 ) << 16 );                    
                                USBSSD->UEP0_TX_CTRL |= USBSS_EP0_TX_ERDY ;
                                break;

                            default:
                                USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH;
                                break;
                        }
                    }
                    break;
                    
                /* end-point 1 data in interrupt */
                case DEF_UEP1:                   
                    USBSSD->EP1_TX.UEP_TX_CHAIN_ST |= USBSS_EP_TX_CHAIN_IF;
                    EP2_Chain_Sel ^= 0x01; 
                    USBSSD->EP2_RX.UEP_RX_DMA = (uint32_t)&USBSS_EP2_Rx_Buf[ DEF_USB_EP2_SS_SIZE * DEF_ENDP2_OUT_BURST_LEVEL * EP2_Chain_Sel ]; 
                    USBSSD->EP2_RX.UEP_RX_CHAIN_MAX_NUMP = DEF_ENDP2_OUT_BURST_LEVEL; 
                    break; 

                /* end-point 2 data in interrupt */
                case DEF_UEP2:
                    USBSSD->EP2_TX.UEP_TX_CHAIN_ST |= USBSS_EP_TX_CHAIN_IF; 
                    EP1_Chain_Sel ^= 0x01; 
                    USBSSD->EP1_RX.UEP_RX_DMA = (uint32_t)&USBSS_EP1_Rx_Buf[ DEF_USB_EP1_SS_SIZE * DEF_ENDP1_OUT_BURST_LEVEL * EP1_Chain_Sel ]; 
                    USBSSD->EP1_RX.UEP_RX_CHAIN_MAX_NUMP = DEF_ENDP1_OUT_BURST_LEVEL; 
                    break;  

                /* end-point 3 data in interrupt */
                case DEF_UEP3:
                    USBSSD->EP3_TX.UEP_TX_CHAIN_ST |= USBSS_EP_TX_CHAIN_IF;
                    EP3_T_Chain_Sel ^= 0x01; 
                    USBSSD->EP3_TX.UEP_TX_DMA = (uint32_t)&USBSS_EP3_Rx_Buf[ DEF_USB_EP3_SS_SIZE * DEF_ENDP3_IN_BURST_LEVEL * EP3_T_Chain_Sel ]; 
                    USBSSD->EP3_TX.UEP_TX_CHAIN_LEN = DEF_USB_EP3_SS_SIZE;
                    USBSSD->EP3_TX.UEP_TX_CHAIN_EXP_NUMP = DEF_ENDP3_IN_BURST_LEVEL;
                    break;  

                default:
                    errflag = 0xFF;
                break;                                     
            }
        }
        else 
        {
            switch( endp_num )
            {
                /* end-point 0 data out interrupt */
                case DEF_UEP0:
                    USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK;       // ready status step
                    break;

                /* end-point 1 data out interrupt */
                case DEF_UEP1:
                    USBSSD->EP2_TX.UEP_TX_DMA = USBSSD->EP1_RX.UEP_RX_DMA - ( USBSSD->EP1_RX.UEP_RX_CHAIN_NUMP * USBSSD->EP1_RX.UEP_RX_DMA_OFS );
                    USBSSD->EP2_TX.UEP_TX_DMA_OFS = USBSSD->EP1_RX.UEP_RX_DMA_OFS;
                    USBSSD->EP2_TX.UEP_TX_CHAIN_LEN = USBSSD->EP1_RX.UEP_RX_CHAIN_LEN;
                    USBSSD->EP2_TX.UEP_TX_CHAIN_EXP_NUMP = USBSSD->EP1_RX.UEP_RX_CHAIN_NUMP;
                    USBSSD->EP1_RX.UEP_RX_CHAIN_ST |= USBSS_EP_RX_CHAIN_IF;                   
                    break; 

                /* end-point 2 data out interrupt */
                case DEF_UEP2:
                    USBSSD->EP1_TX.UEP_TX_DMA = USBSSD->EP2_RX.UEP_RX_DMA - ( USBSSD->EP2_RX.UEP_RX_CHAIN_NUMP * USBSSD->EP2_RX.UEP_RX_DMA_OFS );
                    USBSSD->EP1_TX.UEP_TX_DMA_OFS = USBSSD->EP2_RX.UEP_RX_DMA_OFS;
                    USBSSD->EP1_TX.UEP_TX_CHAIN_LEN = USBSSD->EP2_RX.UEP_RX_CHAIN_LEN;
                    USBSSD->EP1_TX.UEP_TX_CHAIN_EXP_NUMP = USBSSD->EP2_RX.UEP_RX_CHAIN_NUMP;
                    USBSSD->EP2_RX.UEP_RX_CHAIN_ST |= USBSS_EP_RX_CHAIN_IF; 
                    break;  

                /* end-point 3 data out interrupt */
                case DEF_UEP3:
                    EP3_R_Chain_Sel ^= 0x01; 
                    USBSSD->EP3_RX.UEP_RX_DMA = (uint32_t)&USBSS_EP3_Rx_Buf[ DEF_USB_EP3_SS_SIZE * DEF_ENDP3_OUT_BURST_LEVEL * EP3_R_Chain_Sel ];
                    USBSSD->EP3_RX.UEP_RX_CHAIN_MAX_NUMP = DEF_ENDP3_OUT_BURST_LEVEL;
                    USBSSD->EP3_RX.UEP_RX_CHAIN_ST |= USBSS_EP_RX_CHAIN_IF;
                    break;  

                default:
                    errflag = 0xFF;
                break;                  
            }
        }
    }
}
